{
    "basePath":   "http://api.trust.cc",
    "apiVersion": "v0.9",
    "apis": [
        {
            "path": "/v0.9/trust_check",
            "operations": [ {
                "httpMethod": "POST",
                "summary": "Run a trust check on a user, given a Facebook OAuth Token. Or retrieve a score of a previously posted request.",
                "description": "<p>In order to run a Trust Check, you need to initiate a scoring request with a Facebook OAuth token. That's what this operation is for. The same operation, however, also lets you retrieve existing data we may have on this user right away. Lastly, you can also update the user record with this API, if the user logs into your app again; that way we can fetch the latest data, get a fresh token, etc.</p>  <p>This is a one-in many operation which was designed specifically to make the life of client-side or mobile developers as simple as possible. Simply, every time you get a Facebook OAuth token for the user, just call this operation and pass in the token. We'll return back what we already have. If we have nothing yet, then there'll be a short delay, but we let you provide a postback url (web hook) to notify your app when we're done crunching the numbers.</p>  <p>Similarly, any time you just want data on the user, but don't have a fresh Facebook OAuth token, e.g. for some dashboard display or compiling reports, you can just call the same operation and we'll return what we have.</p> <p>If you want to experiment with our API but don't have a Facebook OAuth token, you can easily generate one with the <a href='https://developers.facebook.com/tools/explorer' target='_blank'>Facebook Graph Explorer Tool</a>.</p>",
            "parameters": [
                {
                    "name": "app_id",
                    "description": "3Scale API ID from your appliaction page",
                    "dataType": "string",
                    "required": true,
                    "paramType": "query",
                    "threescale_name": "app_ids"
                },
                {
                    "name": "app_key",
                    "description": "3Scale API KEY from your appliaction page",
                    "dataType": "string",
                    "required": true,
                    "paramType": "query",
                    "threescale_name": "app_keys"
                },
                {
                    "name": "token",
                    "description": "Facebook OAuth token for the user, from the Facebook login flow",
                    "dataType": "string",
                    "required": true,
                    "paramType": "query"
                },
                {
                    "name": "facebook_id",
                    "description": "Facebook User ID, if available. This may be used in lieu of the token to retrieve data, but only if previously a token was submitted. This cannot be used to retrieve data if no user Facebook login is available. Please take a look at our Javascript widget (coming soon), if your client application doesn't have a Facebook login.",
                    "dataType": "string",
                    "required": false,
                    "paramType": "query"
                },
                {
                    "name": "postback_url",
                    "description": "You can optionally provide a Postback Url. This is useful on the first time you make a request and we don't have the scores computed yet. We'll ping your server with the scores, name, image and facebook_id when the computation is finished. For this to work, you **must have set up the Postback Domain** on the Application Dashboard, and the Postback Url passed into the API must match the domain. This is for security reasons. For example the domain on file could be 'myapp.example.com'. Then a qualified Postback Url would be 'https://myapp.example.com/trust_check'.",
                    "dataType": "string",
                    "required": false,
                    "paramType": "query"
                }
            ]
            }]
        }

    ]

}